function importAll(r) {
    return r.keys().map(r);
}

const images = importAll(
    require.context("./01_images", false, /\.jpg$/)
);

const caption = [
    //LESSON 1
    "Особлива пропозиція - знижка до 60%",
    "Заходьте, відкрито, вибачте, закрито",
    "Розпродаж, знижка до 50%",
    "Вхід. Вихід",
    "Тільки картки, без готівки",
    //LESSON 2
    "У цій зоні заборонено вживати їжу та напої",
    "Люблю дні, коли це моя єдина проблема",
    "Тиха зона, не турбувати",
    "Оголошення — Будь ласка, вимикайте світло, коли не користуєтеся",
    "Будь ласка, приберіть за собою служниця у відпустці",
    //LESSON 3
    "Креативний куточок: олівці, фломастери, скотч",
    "Місце для читання - Будь ласка, дбайте про книжки",
    "Повільно — граються діти",
    "Час зустрітится з музикою",
    "Діючий будівельний майданчик, стежте за рухомою технікою",
    //LESSON 4
    "Відправлення Прибуття Багаж Реєстрація Трансфер",
    "Вихід • Видача багажу • Служба підтримки клієнтів ",
    "Усі інші паспорти • Прискорений прохід • Паспорти ЄС/Великої Британії • Кордон Великої Британії",
    "Пункт призначення • Хвилини • Платформа • Схема руху",
    "Оголошення з безпеки — Вийміть усе з кишень перед проходженням через детектори.",
    //LESSON 5
    "Зберігаємо спокій та готуємо разом!",
    "Цю кухню слід підтримувати в чистоті та порядку",
    "Здорове серце потребує здорової їжі та фізичної активності",
    "Кондитерська — Усе спечено сьогодні",
    "Зона приготування їжі — Лише для овочів",
    //LESSON 6
    "",
    "",
    "",
    "",
    "",
    //LESSON 7
    "",
    "",
    "",
    "",
    "",
    //LESSON 8
    "",
    "",
    "",
    "",
    "",
    //LESSON 9
    "",
    "",
    "",
    "",
    "",
    //LESSON 10
    "",
    "",
    "",
    "",
    "",
    //LESSON 11
    "",
    "",
    "",
    "",
    "",
    //LESSON 12
    "",
    "",
    "",
    "",
    "",
    //LESSON 13
    "",
    "",
    "",
    "",
    "",
    //LESSON 14
    "",
    "",
    "",
    "",
    "",
    //LESSON 15
    "",
    "",
    "",
    "",
    "",
    //LESSON 16
    "",
    "",
    "",
    "",
    "",
    //LESSON 17
    "",
    "",
    "",
    "",
    "",
    //LESSON 18
    "",
    "",
    "",
    "",
    "",
    //LESSON 19
    "",
    "",
    "",
    "",
    "",
    //LESSON 20
    "",
    "",
    "",
    "",
    "",
    //LESSON 21
    "",
    "",
    "",
    "",
    "",
    //LESSON 22
    "",
    "",
    "",
    "",
    "",
    //LESSON 23
    "",
    "",
    "",
    "",
    "",
    //LESSON 24
    "",
    "",
    "",
    "",
    "",
    //LESSON 25
    "",
    "",
    "",
    "",
    "",
    //LESSON 26
    "",
    "",
    "",
    "",
    "",
    //LESSON 27
    "",
    "",
    "",
    "",
    "",
    //LESSON 28
    "",
    "",
    "",
    "",
    "",
    //LESSON 29
    "",
    "",
    "",
    "",
    "",
    //LESSON 30
    "",
    "",
    "",
    "",
    "",

]

export const ReadingSignsData = images.map((image, index) => (
    {
        id: index + 1,
        lesson: Math.floor(index / 5) + 1,
        image,
        caption: caption[index],
        visibility: "hidden",
    }
))
