function importAll(r) {
    return r.keys().map(r);
}

const images = importAll(
    require.context("./01_images", false, /\.jpg$/)
);

const caption = [
    //LESSON 1
    "Особлива пропозиція - знижка до 60%",
    "Заходьте, відкрито, вибачте, закрито",
    "Розпродаж, знижка до 50%",
    "Вхід. Вихід",
    "Тільки картки, без готівки",
    //LESSON 2
    "У цій зоні заборонено вживати їжу та напої",
    "Люблю дні, коли це моя єдина проблема",
    "Тиха зона, не турбувати",
    "Оголошення — Будь ласка, вимикайте світло, коли не користуєтеся",
    "Будь ласка, приберіть за собою служниця у відпустці",
    //LESSON 3
    "Креативний куточок: олівці, фломастери, скотч",
    "Місце для читання - Будь ласка, дбайте про книжки",
    "Повільно — граються діти",
    "Час зустрітится з музикою",
    "Діючий будівельний майданчик, стежте за рухомою технікою",
    //LESSON 4
    "Відправлення Прибуття Багаж Реєстрація Трансфер",
    "Вихід • Видача багажу • Служба підтримки клієнтів ",
    "Усі інші паспорти • Прискорений прохід • Паспорти ЄС/Великої Британії • Кордон Великої Британії",
    "Пункт призначення • Хвилини • Платформа • Схема руху",
    "Оголошення з безпеки — Вийміть усе з кишень перед проходженням через детектори.",
    //LESSON 5
    "Зберігаємо спокій та готуємо разом!",
    "Цю кухню слід підтримувати в чистоті та порядку",
    "Здорове серце потребує здорової їжі та фізичної активності",
    "Кондитерська — Усе спечено сьогодні",
    "Зона приготування їжі — Лише для овочів",
    //LESSON 6
    "Час, проведений із родиною, вартий кожної секунди",
    "Правила ігрової кімнати — Будь добрим, Ділись, Веселись",
    "Живи повноцінно, Люби щиро, Смійся часто",
    "Щастя — це... дзвінок від близьких",
    "Новий дім, новий початок, нові спогади",
    //LESSON 7
    "Читання дарує нам місце, куди можна вирушити, навіть коли ми змушені залишатися на місці",
    "Не говори зі мною — у мене немає сили волі, я проговорю з тобою годинами й нічого не зроблю",
    "Візьми чашечку чаю — опануй нову навичку сьогодні",
    "Будь відповідальним. Будь ввічливим. Будь готовим до навчання",
    "Використання особистих мобільних пристроїв під час занять більше не дозволяється",
    //LESSON 8
    "Ставте речі на їхні місця",
    "Години роботи: понеділок–п’ятниця 8:00–17:00, субота–неділя — за домовленістю",
    "Безпека починається з командної роботи",
    "Думайте про чистоту. Ця кімната для вашої зручності. Будь ласка, підтримуйте її в чистоті",
    "Мрій масштабно, став цілі, дій",
    //LESSON 9
    "Будь ласка, перевіряйте ціну перед замовленням їжі та напоїв",
    "Заощаджуйте сьогодні — ваші гроші врятують вас завтра",
    "Повторне використання. Скорочення. Переробка",
    "Увага! Оплата лише банківською карткою або безконтактним способом. Тільки сьогодні",
    "Зберігайте чек — без чека повернення або обміну немає",
    //LESSON 10
    "Школа не несе відповідальності за втрату будь-яких пристроїв, які ваша дитина приносить до школи",
    "Думай, перш ніж щось публікувати — це правда, корисно, надихає, необхідно, доброзичливо?",
    "Поради щодо балансу між онлайн- і офлайн-часом",
    "Електронна безпека: не спілкуйтесь із незнайомцями, особливо в інтернеті",
    "Яким цифровим громадянином є ти?",
    //LESSON 11
    "",
    "",
    "",
    "",
    "",
    //LESSON 12
    "",
    "",
    "",
    "",
    "",
    //LESSON 13
    "",
    "",
    "",
    "",
    "",
    //LESSON 14
    "",
    "",
    "",
    "",
    "",
    //LESSON 15
    "",
    "",
    "",
    "",
    "",
    //LESSON 16
    "",
    "",
    "",
    "",
    "",
    //LESSON 17
    "",
    "",
    "",
    "",
    "",
    //LESSON 18
    "",
    "",
    "",
    "",
    "",
    //LESSON 19
    "",
    "",
    "",
    "",
    "",
    //LESSON 20
    "",
    "",
    "",
    "",
    "",
    //LESSON 21
    "",
    "",
    "",
    "",
    "",
    //LESSON 22
    "",
    "",
    "",
    "",
    "",
    //LESSON 23
    "",
    "",
    "",
    "",
    "",
    //LESSON 24
    "",
    "",
    "",
    "",
    "",
    //LESSON 25
    "",
    "",
    "",
    "",
    "",
    //LESSON 26
    "",
    "",
    "",
    "",
    "",
    //LESSON 27
    "",
    "",
    "",
    "",
    "",
    //LESSON 28
    "",
    "",
    "",
    "",
    "",
    //LESSON 29
    "",
    "",
    "",
    "",
    "",
    //LESSON 30
    "",
    "",
    "",
    "",
    "",

]

export const ReadingSignsData = images.map((image, index) => (
    {
        id: index + 1,
        lesson: Math.floor(index / 5) + 1,
        image,
        caption: caption[index],
        visibility: "hidden",
    }
))
